---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ThermalAsset Methods
ThermalAsset Class See Also Send Feedback
---

The ThermalAsset type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Copy | Produces a copy of the asset. |
|  | Dispose |  |
|  | Equals(Object) | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
|  | Equals(ThermalAsset) | Determines whether this thermal asset is equal to another. |
|  | EqualsThermalOnly | Determines whether this thermal asset is equal to another, but ignore data from base class. |
|  | GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object.) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also

ThermalAsset Class

Autodesk.Revit.DB Namespace